[
  {
    "row_no": "1",
    "video": "Black to Indian Navy crest over the Tricolour; slow fade to the façade of Manekshaw Centre; crisp brass section swell. Super: “Swavlamban 2025 · Manekshaw Centre · 25–26 Nov 2025”.\n1) STRENGTH & POWER THROUGH INNOVATION AND INDIGENISATION\n2) नवाचार एवं स्वदेशीकरण से सशक्तिकरण",
    "audio": "Narrator (measured, ceremonial): Swavlamban 2025—the Indian Navy’s annual seminar and exhibition of innovation and indigenisation, organised by the Naval Innovation & Indigenisation Organisation, NIIO. Strength and Power through Innovation and Indigenisation… नवाचार एवं स्वदेशीकरण से सशक्तिकरण."
  },
  {
    "row_no": "2",
    "video": "A dignified corridor walk-through: officers and sailors pass framed photographs of ships, submarines and fleet exercises; exhibition signage reveals the floor plan; ushers guide visitors.",
    "audio": "Here, India’s armed forces, engineers, scientists, startups and MSMEs—meet with a single purpose: to turn ideas into operational capabilities for the Fleet."
  },
  {
    "row_no": "3",
    "video": "Montage: INS Vikrant under way; frigate at speed; a submarine slipping beneath the surface; carrier deck operations; a destroyer launching a missile; cut to labs and integration bays.",
    "audio": "Aatmanirbharta at sea is not a slogan; it is a disciplined programme—clear requirements, rigorous trials, and decisive adoption—so that the sailor at sea receives what works, when it is needed."
  },
  {
    "row_no": "4",
    "video": "NIIO welcome desk; inaugural lamp-lighting; the exhibition opens; the hall is ordered, calm, professional.",
    "audio": "NIIO provides the Navy’s institutional framework to identify needs, engage innovators and shepherd solutions from problem statement to pier-side fitment."
  },
  {
    "row_no": "5",
    "video": "Minimal onscreen counter animates once and settles; no flashy motion graphics.",
    "audio": "Since inception, our journey is measured in outcomes: Acceptance of Necessity sanctioned—₹2,744 crore; contracts concluded—₹1,457 crore. Cumulative, deliberate, and real."
  },
  {
    "row_no": "6",
    "video": "SECTION SLATE — Operational Readiness: Crew Safety & Damage Control",
    "audio": "Lives protected. Readiness preserved."
  },
  {
    "row_no": "7",
    "video": "Shipboard drill: a team dons Aerogel Fire Proximity Suits; one sailor clips a temperature tag; another checks glove grip. A Caged Drone with thermal imaging lifts and enters a smoke-filled compartment, its display mirrored on a handheld. Rugged DC/FF Torch beam cuts through smoke.",
    "audio": "On the line between danger and duty, indigenous gear gives confidence: suits that resist heat, optics that see through smoke, and tools designed for gloved hands and rolling decks."
  },
  {
    "row_no": "8",
    "video": "Close cuts: Smart Firefighting Retrofit attaches to existing breathing sets; a firefighter checks flow; the Cooling Vest is zipped beneath a jacket; the Portable Hydraulic Metal Cutter bites through deformed plate.",
    "audio": "Smart retrofits raise performance without changing core equipment. Cooling vests shorten recovery. Hydraulic cutting saves precious minutes in confined spaces."
  },
  {
    "row_no": "9",
    "video": "Exhibition vignette: clean plinths display Aerogel Suits, TIC Caged Drone, Retrofit kits, DC/FF torch, Cooling vests, Hydraulic cutter; spec placards; quick exchanges between ship’s crew and innovators.",
    "audio": "Designed for the sea. Built for the Fleet. Scaled for the Navy. These are the quiet multipliers that preserve combat power."
  },
  {
    "row_no": "10",
    "video": "SECTION SLATE — Undersea Robotics & Subsea Enablers",
    "audio": "Endurance and precision beneath the waves."
  },
  {
    "row_no": "11",
    "video": "An AUV leaves a RHIB and begins its leg; overlay shows the Underwater Navigation System holding a precise track; bathymetry appears as a clean ribbon.",
    "audio": "Underwater Navigation for AUVs brings reliable tracks in littorals and harbours, enabling missions that demand precision over hours rather than minutes."
  },
  {
    "row_no": "12",
    "video": "Graphic: Underwater Communication for a Swarm of AUVs; bursts of data hop from vehicle to vehicle; on a ship’s screen, the mission status tiles update in sequence.",
    "audio": "Swarm communication ensures every node contributes to the mission—even when the sea is noisy and the range is long."
  },
  {
    "row_no": "13",
    "video": "ROV footage: manipulators touch a hull; corrosion area is tagged; a diver supervises from a safe distance.",
    "audio": "Underwater ROVs reduce risk and increase repeatability during inspection and repair—every check logged, every anomaly recorded."
  },
  {
    "row_no": "14",
    "video": "A submarine launches SLXBT; an operator reads a temperature profile on a plot; the Submarine Voyage Data Recorder screen rolls through a time slice of events.",
    "audio": "Ocean data informs tactics. Voyage data captures truth. Together they sharpen decision-making under water."
  },
  {
    "row_no": "15",
    "video": "SECTION SLATE — C4ISR: The Real-Time Maritime Picture",
    "audio": "From sensors to decisions, in real time."
  },
  {
    "row_no": "16",
    "video": "Split screen: a UAV camera looks over a convoy; the feed passes through Encore (Vegazel) Real-Time Video Relay; a throughput gauge for VegaZL Very-High-Speed Data Transfer rises; a Shipborne Lightweight ESM/COMINT console shows signals deburdened and classified.",
    "audio": "A sovereign data fabric—built on Indian relays, Indian links and Indian electronic sensing—turns information into awareness, and awareness into advantage."
  },
  {
    "row_no": "17",
    "video": "Operator view: a secure waveform icon shows link health between platforms; the common operating picture aligns tracks, labels threat emissions and time-stamps the video feed.",
    "audio": "When the picture is instantaneous and sovereign, the Fleet moves with confidence. This is Strength and Power through Innovation and Indigenisation."
  },
  {
    "row_no": "18",
    "video": "SECTION SLATE — Autonomy at Sea",
    "audio": "Distributed. Persistent. Scalable."
  },
  {
    "row_no": "19",
    "video": "At sea, a ring of Autonomous Weaponised Boat Swarms forms ahead of a task group; the boats weave into a skirmish line and hold station using coordinated guidance.",
    "audio": "Autonomy at sea extends reach and resilience. Distributed effectors create layered security—few signatures, many dilemmas for an adversary."
  },
  {
    "row_no": "20",
    "video": "In the littorals, an Autonomous Beach-Check Survey Device maps a surf zone; obstacles are flagged on a tablet as depth colours shift with each pass.",
    "audio": "In the near shore, minutes matter. Fast, unmanned beach surveys reduce risk, compress timelines and prepare the way."
  },
  {
    "row_no": "21",
    "video": "SECTION SLATE — Aviation Safety & Ground Operations AI",
    "audio": "Sortie safety, assured."
  },
  {
    "row_no": "22",
    "video": "An apron camera feed; the AI-based FOD Detection & Classification box flashes amber, then red; ground crew inspect and remove a metallic shard.",
    "audio": "Artificial Intelligence on the flightline protects engines and aircrew. Incidents prevented never make news—but they save aircraft, time and life."
  },
  {
    "row_no": "23",
    "video": "At night, a helicopter aligns for a shipborne recovery using GNSS 3‑D Approach; a guidance cue descends to the deck; touchdown is smooth.",
    "audio": "Precise approach and landing cues, optimised for maritime motion, build confidence on the hardest nights."
  },
  {
    "row_no": "24",
    "video": "A small RPA fitted with a Lightweight ELINT/COMINT pod taxis; a console shows a clean geolocation fix of a training emitter.",
    "audio": "Compact airborne sensing gives the Fleet flexible options—low-cost, high-utility sorties that enrich the maritime picture."
  },
  {
    "row_no": "25",
    "video": "SECTION SLATE — Acoustics & ASW Enablers",
    "audio": "Find, fix, and train—indigenously."
  },
  {
    "row_no": "26",
    "video": "Console view: 3‑D Forward Looking Sonar paints a harbour ingress; cable routes and obstructions are obvious in profile.",
    "audio": "Forward-looking sonar de-risks passages where time is tight and margins are narrow."
  },
  {
    "row_no": "27",
    "video": "Spectrogram before/after Adaptive Noise Cancellation on an AUV; clutter fades, targets stand up; similar effect on a shipborne sonar feed.",
    "audio": "Adaptive processing cuts through the sea’s noise. Detection improves, effort reduces."
  },
  {
    "row_no": "28",
    "video": "A coxswain deploys EMATT; a sonarman listens; the training run is logged with precise parameters. At a range, a Portable RCS Measuring Device calibrates a model for realism.",
    "audio": "We train like we fight—on instruments we understand and can adapt."
  },
  {
    "row_no": "29",
    "video": "SECTION SLATE — Sensors & Silicon",
    "audio": "From silicon to sky."
  },
  {
    "row_no": "30",
    "video": "Macro: AESA transmit–receive module and cooling plate; waveguide assembly; inspection light glints across the array surface.",
    "audio": "Indigenous AESA gives the Fleet agility in air and surface surveillance—steerable beams, smart modes, and maintenance the Navy owns."
  },
  {
    "row_no": "31",
    "video": "An Electro‑Optical/IR Sensor Pod swivels under a wing; on a screen, IR and EO channels are fused; labels are crisp and stable.",
    "audio": "Electro‑optical systems complement radar with identification and assessment—steady imagery, sovereign processing, results we trust."
  },
  {
    "row_no": "32",
    "video": "Bench: an ASIC Beamforming Radar board runs a test pattern; a small team watches a monitor with beam plots.",
    "audio": "Custom silicon reduces size, power and weight; maritime sensors become smarter and more efficient."
  },
  {
    "row_no": "33",
    "video": "Rack: Airborne Lightweight COMINT equipment; a technician updates a threat library; a small aircraft lifts off.",
    "audio": "Airborne COMINT extends the Navy’s ears where they are needed, without large footprints."
  },
  {
    "row_no": "34",
    "video": "SECTION SLATE — Positioning When GNSS Is Denied",
    "audio": "Navigation assurance, by design."
  },
  {
    "row_no": "35",
    "video": "Night sky: an Automated Celestial Navigation unit tracks stars; on a repeater, a clean position fix appears alongside inertial estimates.",
    "audio": "Celestial navigation returns with automation—quiet, precise, independent of external signals."
  },
  {
    "row_no": "36",
    "video": "Graphic: Depth-based Positioning from a ship to a submarine; contours and pressure data resolve a fix; the submarine updates its track.",
    "audio": "Depth and ocean data support submerged operations with reliable position updates when silence is essential."
  },
  {
    "row_no": "37",
    "video": "Lab: a Quantum Positioning System prototype mounted on a table; a stability plot scrolls; technicians confer quietly.",
    "audio": "Quantum sensors point to a future where precision persists even when the sky is denied."
  },
  {
    "row_no": "38",
    "video": "SECTION SLATE — Harbour Turn-around & Shore Systems",
    "audio": "Efficiency at harbour, power at sea."
  },
  {
    "row_no": "39",
    "video": "Time-lapse alongside: Smart Retractable Cable Gangways reach and latch; Smart Mobile Units connect for Submarine Shore Supply and Charging; a Material Movement trolley transfers loads along a marked path.",
    "audio": "Harbour efficiency is combat power in the next sortie. Safe connections and fast logistics compress turn-around."
  },
  {
    "row_no": "40",
    "video": "SECTION SLATE — Logistics & Persistent ISR",
    "audio": "Endurance without excess."
  },
  {
    "row_no": "41",
    "video": "A Heavy‑Lift Tethered Aerial Vehicle rises to mast height, holding a stable overwatch above a harbour entrance; the cable is taut, the image steady.",
    "audio": "Tethered lift provides persistent eyes at fractional cost—hours of coverage, minimal crew burden."
  },
  {
    "row_no": "42",
    "video": "On a rooftop, a Skydeck arm auto‑launches a small quadcopter; later, the same arm recovers and charges it for the next sortie.",
    "audio": "Automated launch, recovery and charging allow small teams to sustain surveillance rhythms without fatigue."
  },
  {
    "row_no": "43",
    "video": "An Autonomous Cargo Carrying Aerial Vehicle lifts a crate from a jetty and crosses to a ship at anchor; on another leg, the ARUN ultra‑endurance drone stretches a long patrol over sea lanes.",
    "audio": "Agile lift and long‑range persistence multiply reach across fleet and shore."
  },
  {
    "row_no": "44",
    "video": "SECTION SLATE — Special Operations & Deck‑Edge Aids",
    "audio": "Precision at the edge."
  },
  {
    "row_no": "45",
    "video": "A boarding team gears up; the Smart Reflex TT‑III sight is checked against a counter‑UAS drill; elsewhere, a programmable VT fuze warhead demonstrates a safe standoff burst against a target drone surrogate.",
    "audio": "Close‑in precision and safe effects—tools tailored to littorals and boarding operations."
  },
  {
    "row_no": "46",
    "video": "A Special‑Ops Expendable Payload Delivery tube slides a compact package into the sea from a RHIB; GPS tag flashes green on a tablet.",
    "audio": "Special operations demand quiet reach; compact delivery systems provide it."
  },
  {
    "row_no": "47",
    "video": "SECTION SLATE — Materials & Protective Systems",
    "audio": "The maritime environment, engineered."
  },
  {
    "row_no": "48",
    "video": "A Moisture‑Wicking Hydrophobic Weapon Cover sheds spray under a nozzle test; nearby, Thermal/Ultrasonic Stealth Insulation panels show reduced signature on an IR camera.",
    "audio": "Materials tuned for salt, heat and noise preserve performance and reduce detectability across missions."
  },
  {
    "row_no": "49",
    "video": "SECTION SLATE — The Working Forum",
    "audio": "Where requirements become reality."
  },
  {
    "row_no": "50",
    "video": "Exhibition floor: capability name primary on clean title cards; firm name optional where cleared; Navy officers walk the aisles and ask precise questions; innovators note changes on clipboards.",
    "audio": "Swavlamban is not only a seminar; it is a working forum. Requirements are clarified, prototypes refined, and pathways to induction agreed—with rigor and speed."
  },
  {
    "row_no": "51",
    "video": "Panel: Navy leadership with administrators, industry and academia in measured dialogue; no soundbites—only purposeful exchange; lower‑thirds identify speakers by role.",
    "audio": "Clarity of need. Certainty of trial. Decisiveness of adoption. This culture is the Navy’s advantage."
  },
  {
    "row_no": "52",
    "video": "Quiet corridor: NIIO milestone wall; trial cards with signatures; acceptance notes placed into folders; a final document stamped.",
    "audio": "Processes matter—transparent trials, sound engineering and planned sustainment ensure innovation endures at sea."
  },
  {
    "row_no": "53",
    "video": "Recap montage: one exemplar from each niche flashes briefly—Aerogel Suit, AUV Nav track, Encore relay, Boat Swarm screen, FOD alert, Sonar profile, AESA tile, Celestial fix, Gangway latch, HLTAV mast, Boarding sight—then back to Manekshaw Centre at dusk.",
    "audio": "From the flight deck to the engine room, from harbour wall to ocean floor—Aatmanirbharta advances, one delivered capability at a time."
  },
  {
    "row_no": "54",
    "video": "• SWAVLAMBAN 2025\n• STRENGTH & POWER THROUGH INNOVATION AND INDIGENISATION\n• नवाचार एवं स्वदेशीकरण से सशक्तिकरण\n• Footer: Organised by the Naval Innovation & Indigenisation Organisation (NIIO)",
    "audio": "Swavlamban 2025—organised by the Naval Innovation & Indigenisation Organisation.  Strength and Power through Innovation and Indigenisation… नवाचार एवं स्वदेशीकरण से सशक्तिकरण. Jai Hind."
  }
]